[{"_id":{"$oid":"6662651d9075fc1af06617d3"},"name":"Rock","description":"Elvis Presley was for years considered the \"King of Rock and Roll,\" but the Beatles, are often hailed as the greatest rock band, epitomize this genre. Standard instruments include electric guitar, bass guitar, drums, and keyboards. Iconic rock songs include Elvis Presley&apos;s \"Jailhouse Rock,\" The Beatles \"Hey Jude,\" Led Zeppelin&apos;s \"Stairway to Heaven,\" and The Rolling Stones&apos; \"Satisfaction.\"","history":"Rock music originated in the United States in the late 1940s and early 1950s, evolving from rock and roll and rhythm and blues. It is known for its strong beat, simple chord progressions, and use of electric guitar.","__v":3,"imageUri":"https://www.thesun.co.uk/wp-content/uploads/2023/02/photo-elvis-presley-photo-michael-54084287.jpg?strip=all&w=953","instruments":[{"$oid":"6662651d9075fc1af06617db"},{"$oid":"6662651d9075fc1af06617de"},{"$oid":"6666087aad68717c6311c683"},{"$oid":"666606cbad68717c6311c65a"},{"$oid":"66662c2091a2c702d72aba83"},{"$oid":"66662d1e91a2c702d72aba9a"},{"$oid":"66665795d850fd31aff12e66"}]},{"_id":{"$oid":"6662651d9075fc1af06617d2"},"name":"Blues","description":"It incorporates spirituals, work songs, and field hollers and is characterized by its use of the twelve-bar blues progression. B.B. King, known as the \"King of the Blues,\" is a prominent musician in this genre. Instruments typically include the guitar, harmonica, piano, and bass. Signature songs include King&apos;s \"The Thrill Is Gone,\" Robert Johnson&apos;s \"Cross Road Blues,\" and Muddy Waters&apos;s \"Hoochie Coochie Man.\"","history":"The blues genre developed in the Deep South of the United States around the end of the 19th century.","__v":0,"imageUri":"https://www.rollingstone.com/wp-content/uploads/2018/06/rs-195232-85224761.jpg?w=1581&h=1054&crop=1","instruments":[{"$oid":"6662651d9075fc1af06617db"},{"$oid":"6666087aad68717c6311c683"},{"$oid":"666606cbad68717c6311c65a"},{"$oid":"66661e68ad68717c6311c79c"},{"$oid":"66661efdad68717c6311c7a8"},{"$oid":"66662c2091a2c702d72aba83"},{"$oid":"66666190d850fd31aff12ef4"}]},{"_id":{"$oid":"6662651d9075fc1af06617d1"},"name":"Jazz","description":"It is distinguished by its use of improvisation, syncopated rhythms, and distinctive swing feel. Louis Armstrong, known for his virtuosic trumpet playing and gravelly voice, is a key figure in jazz. Typical instruments include the trumpet, saxophone, double bass, piano, and drums. Famous pieces include Armstrong&apos;s \"What a Wonderful World,\" Duke Ellington&apos;s \"Take the &lsquo;A&rsquo; Train,\" and Miles Davis&apos;s \"Kind of Blue.\"","history":"Jazz emerged in the late 19th and early 20th centuries in the United States, primarily within African American communities.","__v":1,"imageUri":"https://s26162.pcdn.co/wp-content/uploads/2020/08/5j4hkj45h.png.jpeg","instruments":[{"$oid":"6662651d9075fc1af06617de"},{"$oid":"6666087aad68717c6311c683"},{"$oid":"666606cbad68717c6311c65a"},{"$oid":"66660b32ad68717c6311c702"},{"$oid":"66661e68ad68717c6311c79c"},{"$oid":"66661efdad68717c6311c7a8"},{"$oid":"66662c2091a2c702d72aba83"},{"$oid":"66662d1e91a2c702d72aba9a"},{"$oid":"66665795d850fd31aff12e66"},{"$oid":"66665956d850fd31aff12e8d"},{"$oid":"66666190d850fd31aff12ef4"}]},{"_id":{"$oid":"6662651d9075fc1af06617d4"},"name":"Pop","description":" It is characterized by catchy melodies and simple, relatable lyrics. Michael Jackson, dubbed the \"King of Pop,\" is a central figure in this genre. Common instruments include the electric guitar, synthesizer, drums, and bass. Noteworthy pop songs include Jackson&apos;s \"Thriller,\" Madonna&apos;s \"Like a Virgin,\" and Britney Spears&apos;s \"...Baby One More Time.\"","history":"Pop music, designed to appeal to a broad audience, emerged in its modern form during the mid-1950s in the United States and United Kingdom.","__v":1,"imageUri":" https://hips.hearstapps.com/hmg-prod/images/gettyimages-610598430-1533292763.jpg?resize=1200:*","instruments":[{"$oid":"6662651d9075fc1af06617db"},{"$oid":"6662651d9075fc1af06617dc"},{"$oid":"6662651d9075fc1af06617de"},{"$oid":"6666087aad68717c6311c683"},{"$oid":"666606cbad68717c6311c65a"},{"$oid":"66660c5ead68717c6311c73a"},{"$oid":"66662c2091a2c702d72aba83"},{"$oid":"66662d1e91a2c702d72aba9a"}]},{"_id":{"$oid":"6662651d9075fc1af06617d5"},"name":"Country","description":"It is known for its storytelling lyrics and acoustic instrumentation. Johnny Cash, with his deep, resonant voice, is a legendary figure in country music. Common instruments include the acoustic guitar, banjo, fiddle, and harmonica. Classic songs include Cash&apos;s \"Ring of Fire,\" Dolly Parton&apos;s \"Jolene,\" and Hank Williams&apos;s \"Your Cheatin&apos; Heart.\"","history":"Country music, with roots in American folk music, blues, and Western music, originated in the southern United States in the 1920s.","__v":2,"imageUri":"https://images.squarespace-cdn.com/content/v1/5cf695dd0556430001c0221c/1601389615693-IAZ66B1CDH266WSBYO46/cce3dc88-3c08-41a2-ab54-86b3a99056aa-Country_Music_Week-106b.jpg?format=1500w","instruments":[{"$oid":"6662651d9075fc1af06617db"},{"$oid":"666608ffad68717c6311c697"},{"$oid":"66665fbcd850fd31aff12ecb"},{"$oid":"6666604cd850fd31aff12ed6"},{"$oid":"66666190d850fd31aff12ef4"},{"$oid":"66689c9d0dedbe97bfcac653"}]},{"_id":{"$oid":"6662651d9075fc1af06617d6"},"name":"Folk","description":"Bob Dylan, known for his profound lyrics and influence on contemporary music, is a pivotal figure in folk. Instruments typically include the acoustic guitar, harmonica, and banjo. Significant works include Dylan&apos;s \"Blowin&apos; in the Wind,\" Woody Guthrie&apos;s \"This Land Is Your Land,\" and Joan Baez&apos;s \"Diamonds & Rust.\"","history":"Folk music encompasses traditional music passed down orally and contemporary music that retains traditional elements. It often addresses social and political issues.","__v":0,"imageUri":"http://wfdd-live.s3.amazonaws.com/images/story/50-Years-Ago-Bob-Dylan-Electrified-A-Decade-With-One-Concert-425066868-1445827463.jpg","instruments":[{"$oid":"66660b32ad68717c6311c702"},{"$oid":"66662d1e91a2c702d72aba9a"},{"$oid":"66665fbcd850fd31aff12ecb"},{"$oid":"6666604cd850fd31aff12ed6"},{"$oid":"666660fdd850fd31aff12ee0"},{"$oid":"66666190d850fd31aff12ef4"},{"$oid":"66689c9d0dedbe97bfcac653"}]},{"_id":{"$oid":"6662651d9075fc1af06617d7"},"name":"Reggae","description":" It is known for its offbeat rhythms and socially conscious lyrics. Bob Marley, the most famous reggae artist, brought the genre to international prominence. Instruments often include the electric guitar, bass, drums, and keyboard. Notable tracks include Marley&apos;s \"No Woman, No Cry,\" Peter Tosh&apos;s \"Legalize It,\" and Jimmy Cliff&apos;s \"The Harder They Come.\"","history":"Reggae developed in Jamaica in the late 1960s, evolving from earlier genres like ska and rocksteady.","__v":1,"imageUri":"https://hips.hearstapps.com/hmg-prod/images/photo-of-bob-marley-bob-marley-performing-live-on-stage-at-news-photo-1707857936.jpg?crop=0.624xw:0.984xh;0.158xw,0&resize=1200:*","instruments":[{"$oid":"6662651d9075fc1af06617db"},{"$oid":"66662c2091a2c702d72aba83"}]},{"_id":{"$oid":"6662651d9075fc1af06617d8"},"name":"R&B/Soul","description":"This genre is characterized by its emotive vocals and use of gospel and blues elements. Aretha Franklin, the \"Queen of Soul,\" is a prominent artist in this genre. Typical instruments include the electric guitar, bass, piano, and drums. Renowned songs include Franklin&apos;s \"Respect,\" Marvin Gaye&apos;s \"What&apos;s Going On,\" and Stevie Wonder&apos;s \"Superstition.\"","history":"R&B (Rhythm and Blues) and soul music originated in African American communities in the 1940s and 1950s.","__v":0,"imageUri":"https://www.billboard.com/wp-content/uploads/media/franklin-fea-bb20-debut-2018-jc-dcdkm-billboard-1500.jpg?w=942&h=623&crop=1","instruments":[{"$oid":"6666087aad68717c6311c683"},{"$oid":"66660c5ead68717c6311c73a"},{"$oid":"66661e68ad68717c6311c79c"}]},{"_id":{"$oid":"6662651d9075fc1af06617d9"},"name":"Electronic","description":"It encompasses a wide range of styles, from house and techno to drum and bass and dubstep. Kraftwerk, pioneers of electronic music, are highly influential in this genre. Instruments typically include synthesizers, drum machines, and computer software. Key tracks include Kraftwerk&apos;s \"Autobahn,\" Daft Punk&apos;s \"One More Time,\" and The Prodigy&apos;s \"Firestarter.\"","history":"Electronic music began in the early 20th century with the advent of electronic instruments and technology.","__v":0,"imageUri":"https://sunsetmarquis.com/wp-content/uploads/2024/01/Kraftwerk-in-Concert.webp"},{"_id":{"$oid":"6662651d9075fc1af06617da"},"name":"Hip Hop/Rap","description":"This genre is characterized by rhythmic speech (rapping), DJing, breakdancing, and graffiti art. Tupac Shakur, known for his impactful lyrics and strong presence, is a seminal figure in hip hop. Instruments often include turntables, drum machines, synthesizers, and samplers. Influential works include Tupac&apos;s \"Changes,\" The Notorious B.I.G.&apos;s \"Juicy,\" and Run-D.M.C.&apos;s \"Walk This Way.\"","history":"Hip hop and rap originated in the Bronx, New York City, during the 1970s.","__v":1,"imageUri":"https://ichef.bbci.co.uk/news/1024/cpsprodpb/31CD/production/_131294721_gettyimages-1368528045.jpg.webp","instruments":[{"$oid":"66660c5ead68717c6311c73a"}]},{"_id":{"$oid":"6662651d9075fc1af06617d0"},"name":"Classical","description":"Ludwig van Beethoven, a pivotal figure bridging the Classical and Romantic periods, is strongly associated with this genre. Instruments commonly used include the piano, violin, cello, and flute. Notable works include Beethoven&apos;s \"Symphony No. 9,\" Mozart&apos;s \"Requiem,\" and Bach&apos;s \"Brandenburg Concertos.\"","history":"Classical music, rooted in the traditions of Western liturgical and secular music from the medieval period to the present, is characterized by its highly structured forms and sophisticated compositional techniques. Originating in the late 11th century, it flourished through the Renaissance, Baroque, Classical, Romantic, and Modern eras.","__v":2,"imageUri":"https://www.worldhistory.org/img/r/p/1000x1200/17602.png.webp?v=1717358523","instruments":[{"$oid":"6662651d9075fc1af06617dd"},{"$oid":"6662651d9075fc1af06617de"},{"$oid":"6666087aad68717c6311c683"},{"$oid":"666608ffad68717c6311c697"},{"$oid":"66660a53ad68717c6311c6ec"},{"$oid":"66660b32ad68717c6311c702"},{"$oid":"66660c5ead68717c6311c73a"},{"$oid":"66661efdad68717c6311c7a8"},{"$oid":"66662d1e91a2c702d72aba9a"},{"$oid":"66665702d850fd31aff12e5b"},{"$oid":"66665795d850fd31aff12e66"},{"$oid":"66665853d850fd31aff12e70"},{"$oid":"66665956d850fd31aff12e8d"},{"$oid":"66665a41d850fd31aff12eb6"},{"$oid":"66665a96d850fd31aff12ec1"},{"$oid":"666660fdd850fd31aff12ee0"},{"$oid":"66689c9d0dedbe97bfcac653"}]},{"_id":{"$oid":"6666329a91a2c702d72abae1"},"instruments":[{"$oid":"6662651d9075fc1af06617db"},{"$oid":"6662651d9075fc1af06617dc"},{"$oid":"6662651d9075fc1af06617de"},{"$oid":"666606cbad68717c6311c65a"},{"$oid":"666608ffad68717c6311c697"},{"$oid":"66660a53ad68717c6311c6ec"},{"$oid":"66660b32ad68717c6311c702"},{"$oid":"66661e68ad68717c6311c79c"},{"$oid":"66661fd0ad68717c6311c7d4"},{"$oid":"66662c2091a2c702d72aba83"}],"name":"Alternative/Indie","description":"Alternative/Indie music is a genre that emerged in the 1980s as a counterpoint to mainstream pop and rock. Characterized by its diverse sound, it often features unconventional song structures, experimental techniques, and a DIY ethos. Indie music is produced independently from major commercial record labels, allowing artists greater creative freedom. Bands like R.E.M., The Smiths, and more recently, Arctic Monkeys and Tame Impala, exemplify the genre's broad range of styles, from jangly guitars and introspective lyrics to psychedelic influences and innovative production. This genre often appeals to listeners seeking originality and authenticity in music.","history":"Alternative/Indie music originated in the late 1970s and early 1980s as a response to the commercial and polished sound of mainstream rock and pop music. Rooted in the punk rock ethos of independence and DIY culture, early pioneers like R.E.M., The Smiths, and Sonic Youth laid the groundwork for the genre with their unconventional sounds and independent production methods. Throughout the 1990s, the genre gained wider recognition with bands like Nirvana and Radiohead, who brought alternative music into the mainstream while maintaining its distinct edge and experimental approach. Today, Alternative/Indie music continues to thrive, evolving with new artists who push creative boundaries and maintain the genre's spirit of innovation and individuality","imageUri":"https://consequence.net/wp-content/uploads/2022/05/CoS-HERO_RadioheadOKComputer-1200x675-1.jpg?quality=80","__v":0},{"_id":{"$oid":"666699cf91a2c702d72ac07a"},"instruments":[{"$oid":"6666087aad68717c6311c683"}],"name":"Regtime","description":"Ragtime is a musical genre that originated in the late 19th century, characterized by its syncopated, or \"ragged,\" rhythm. It blends African-American musical styles with European classical music forms and melodies. Ragtime is typically played on the piano and is known for its jaunty, upbeat tempo and intricate, syncopated melodies. Scott Joplin, often called the \"King of Ragtime,\" popularized the genre with compositions like \"Maple Leaf Rag\" and \"The Entertainer,\" which remain iconic examples of this lively and influential style of music.","history":"Ragtime emerged in the late 19th century and peaked in popularity from the 1890s to the 1910s. Characterized by its syncopated rhythms and lively melodies, ragtime blends African-American musical styles with European classical music forms. It is primarily known as piano music, with Scott Joplin being its most famous composer. His works, such as \"Maple Leaf Rag\" and \"The Entertainer,\" played a crucial role in popularizing the genre. Ragtime laid the groundwork for jazz and had a lasting impact on American music.","imageUri":"https://encrypted-tbn3.gstatic.com/licensed-image?q=tbn:ANd9GcTi7ScLuAOftkT2PLzLPWpwO_03U2eMff52gDkX2tk85tTs4TzRLPfmZCPQ_wWgjzXpSDtZlkh2RpMDm3A","__v":0},{"_id":{"$oid":"6666a5bc91a2c702d72ac134"},"instruments":[{"$oid":"6662651d9075fc1af06617dd"},{"$oid":"6662651d9075fc1af06617de"},{"$oid":"6666087aad68717c6311c683"},{"$oid":"666608ffad68717c6311c697"},{"$oid":"66660a53ad68717c6311c6ec"},{"$oid":"66660b32ad68717c6311c702"},{"$oid":"66661e68ad68717c6311c79c"},{"$oid":"66661efdad68717c6311c7a8"},{"$oid":"66661fd0ad68717c6311c7d4"},{"$oid":"66662d1e91a2c702d72aba9a"},{"$oid":"66665956d850fd31aff12e8d"}],"name":"Traditional Pop","description":"Traditional pop, often referred to as classic pop or pre-rock and roll pop, is a genre that flourished from the 1940s to the early 1960s. It is characterized by its emphasis on vocal performance, with lush orchestral arrangements and smooth, melodic tunes. The genre often features crooning vocals and romantic, sentimental lyrics. Iconic artists in this genre include Frank Sinatra, Nat King Cole, and Ella Fitzgerald. Traditional pop laid the groundwork for later developments in the pop music genre, retaining a timeless appeal through its elegant and polished style.","history":"Traditional pop music emerged in the 1940s and remained popular through the early 1960s, preceding the rock and roll era. It features orchestral arrangements and emphasizes smooth, melodic vocal performances. The genre drew from big band, jazz, and swing influences, with artists like Frank Sinatra, Nat King Cole, and Ella Fitzgerald leading the way. Traditional pop's elegant and polished style provided a contrast to the energetic rock and roll that followed, retaining a timeless appeal and influencing later pop music developments.","imageUri":"https://media.gettyimages.com/id/3226316/photo/its-franks-world.jpg?s=2048x2048&w=gi&k=20&c=2yTpJLiqAEMdlBp74gBpGS8xqKJxhWvJNgnLTdKfoJw=","__v":0}]
